#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-f66d79/dns-main/runs/run-V3NQSZAJoMVmGccn

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.aws_route53_zone.selected: Reading...
aws_route53_zone.terraform-subzone: Refreshing state... [id=Z07847533D9B8JNF7QMBA]
data.aws_route53_zone.selected: Read complete after 0s [id=Z1ZGYX2ZIYACUH]
aws_route53_record.terraform-ns: Refreshing state... [id=Z1ZGYX2ZIYACUH_tf.example.com_NS]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.terraform-ns must be replaced
-/+ resource "aws_route53_record" "terraform-ns" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "tf.example.com.therealbenforce.com" -> (known after apply)
      ~ id                               = "Z1ZGYX2ZIYACUH_tf.example.com_NS" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "tf.example.com" -> "tf.therealbenforce.com" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-V3NQSZAJoMVmGccn/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-V3NQSZAJoMVmGccn/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @TheRealBenForce, Action: `pull_request`*